app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `role` = 'guru'
---
    public function index()
    {
        $data['title'] = 'Manajemen Guru';
        $data['users'] = $this->userModel->where('role', 'guru')->findAll();

INSERT INTO `users` (`name`, `email`, `password`, `role`, `nip_nuptk`, `photo`) VALUES ('Tercepat', 'zildjianauqilia@gmail.com', '$2y$10$hDxI0SE7zSS02uES.pSXBeALoR3BEFs/BkC9kPbObaV7MJuZRb6ly', 'guru', NULL, '1737130718_74d5c1ef5df6a7bd0d7c.jpg')
---
            $data['photo'] = 'default.png'; // Jika tidak ada foto, pakai default.png
        }

        $this->userModel->insert($data);

UPDATE `users` SET `name` = 'Kurniawan Dwi Yuliyanto', `nip_nuptk` = '567'
WHERE `users`.`id` IN ('2')
---
            $userData['photo'] = $newName;
        }

        $this->userModel->update($id, $userData);